#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПутьКЖурналу = "W:\LOGS\1cv8c_22880";
КонецПроцедуры

&НаКлиенте
Процедура ПутьКЖурналуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
    СтандартнаяОбработка = ЛОЖЬ;
    
    Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
    ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
    ДиалогОткрытия.Каталог = "";  
    ДиалогОткрытия.Заголовок = "Выберите каталог записи журнала"; 
        
    Параметр = "";
    Оповещение = Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтотОбъект, Параметр );
    ДиалогОткрытия.Показать(Оповещение);
    
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталога_Завершение(Результат, Параметр) Экспорт
    
    Если Результат = Неопределено Тогда
         Сообщить("Каталог не выбран");
         Возврат;
    КонецЕсли;
    
    ПутьКЖурналу = Результат[0]
    
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрочитатьЖурнал(Команда)
	ПрочитатьЖурналНаСервере(ПутьКЖурналу);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитатьЖурналНаСервере(ПутьКЖурналу)
	ТЖСервер.ПрочитатьЖурнал(ПутьКЖурналу);
КонецПроцедуры




#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти
