&НаКлиенте
Процедура ПолучитьОбработкуВыгрузкиСтруктуры(Команда)
	//ВыгрузитьСтруктуруДанныхБД.epf
	Диалог= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр="Внешняя обработка (ВыгрузитьСтруктуруДанныхБД.epf)|ВыгрузитьСтруктуруДанныхБД.epf";
	Диалог.ПолноеИмяФайла= "ВыгрузитьСтруктуруДанныхБД";
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СохранениеОбработкиЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);
КонецПроцедуры
&НаСервере
Функция ПолучитьОбработкуВыгрузки()
	Макет= ПолучитьОбщийМакет("ОбработкаВыгрузкиСтруктуры");
	
	Адрес= ПоместитьВоВременноеХранилище(Макет);
	
	Возврат Адрес;
КонецФункции
&НаКлиенте
Процедура СохранениеОбработкиЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
		
		АдресХранилища= ПолучитьОбработкуВыгрузки();
		МакетОбработки= ПолучитьИзВременногоХранилища(АдресХранилища);
		
		ЗаписьДанных = Новый ЗаписьДанных(ПутьКФайлу);
		Оповещение= Новый ОписаниеОповещения();
		ЗаписьДанных.НачатьЗапись(Оповещение, МакетОбработки); 
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПослеЗаписиОбработкиЗавершение(Результат) Экспорт

КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьСтруктуру(Команда)

	Если ЭтаФорма.Модифицированность Тогда
		Сообщить("Сначала запишите данные");
	Возврат;
	КонецЕсли;
		
	Диалог= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр="Файл структуры БД (*.txt)|*.txt";

	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);

КонецПроцедуры
&НаКлиенте
Процедура ЧтениеФайлаЗавершение(Результат) Экспорт
		стрДанныеБД= Текст.ПолучитьТекст();

		Адрес= ПоместитьВоВременноеХранилище(стрДанныеБД, УникальныйИдентификатор);

		ЗаполнитьСтруктуруБДНаСервере(Адрес);
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСтруктуруБДНаСервере(Адрес)

	СтруктураДанныхСервер.УдалитьСтруктуруНаСервере(Ложь, Объект.Ссылка);
	
	стрДанныеБД= ПолучитьИзВременногоХранилища(Адрес);

	ТаблицыХраненияМетаданных= ЗначениеИзСтрокиВнутр(стрДанныеБД);
	
	СтруктураДанныхСервер.ЗаполнитьСтруктуруБДНаСервере(ТаблицыХраненияМетаданных, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлСтруктуры(Команда)
	Диалог= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр="Файл структуры БД (*.txt)|*.txt";

	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);
КонецПроцедуры
&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено Тогда

		ПутьКФайлу = ВыбранныеФайлы[0];

		ОповещениеЗавершения = Новый ОписаниеОповещения("ЧтениеФайлаЗавершение", ЭтотОбъект);
		Текст.НачатьЧтение(ОповещениеЗавершения, ПутьКФайлу, КодировкаТекста.UTF8);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтруктуру(Команда)
	УдалитьСтруктуруНаСервере();
	Закрыть();
КонецПроцедуры
&НаСервере
Процедура УдалитьСтруктуруНаСервере()
	СтруктураДанныхСервер.УдалитьСтруктуруНаСервере(Ложь, Объект.Ссылка);
КонецПроцедуры