#Область ОбработчикиСобытийФормы


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТренслироватьЗапрос(Команда)
	РазобратьТекстЗапроса();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РазобратьТекстЗапроса()
	Запрос1С = РазборЗапросаСервер.РазобратьТекстЗапроса(Запись.Замер, Запись.Sql);
	
	Если Не ПустаяСтрока(Запрос1С) Тогда
		Запись.Запрос1С = Запрос1С;
	
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
