#Область ОбработчикиСобытийФормы


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТренслироватьЗапрос(Команда)
	ТренслироватьЗапросНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТренслироватьЗапросНаСервере()
	Запрос1С = ТранслироватьЗапрос.ТранслироватьЗапрос(Запись.Sql);
	
	Если Не ПустаяСтрока(Запрос1С) Тогда
		Запись.Запрос1С = Запрос1С;
	
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
